'----------------------------------------------------------------------------'
def increment(n):
    """Returns: the value of n+1"""
    return n+1
'----------------------------------------------------------------------------'
def print_wold():
    print ("Hello")
'--------------------------การบวกค่า--------------------------------------------------'
def summation(a,b):
    return a+b
'--------------------------การลบค่า--------------------------------------------'
def decrement(N):
    return N-1
'--------------------------กำลังสอง---------------------------------------------------'
def square(X):
    return X**2
total = square(4)
'--------------------------ตัวแปรท้องถิ่น---------------------------------------------------'
def name():
    xy = "Phuwanat"
    return xy
xy_out = name()
'--------------------------ผลลัพธ์--------------------------------------------------'
print ('xy =',xy_out)
print ('Total =',total)
print (increment (5))
print (summation(3,5))
print (decrement(5))
print_wold()
'--------------------------ตัวแปรท้องถิ่น---------------------------------------------------'
def foo(a,b):
    aa =a
    bb = b
    return aa*bb+bb

foo (3,4)